# SetTransform Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssemblyInstance..::..SetTransform Method
AssemblyInstance Class See Also
---
Sets the origin of the assembly instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetTransform(
	Transform trf
)
```

Visual Basic
---
```text
Public Sub SetTransform ( _
	trf As Transform _
)
```

Visual C++
---
```text
public:
void SetTransform(
	Transform^ trf
)
```

# ### Parameters
trf
    Type: Autodesk.Revit.DB..::..Transform Transform to be set.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..ArgumentsInconsistentException | trf is not a rigid body transformation. |

# See Also
AssemblyInstance Class
Autodesk.Revit.DB Namespace